robert-hh/micropython/ports/mimxrt/machine_sdcard.c

/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2021 Philipp Ebensberger
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/runtime.h"
#include "extmod/vfs.h"
#include "fsl_iomuxc.h"
#include "fsl_cache.h"
#include "fsl_usdhc.h"

#include "ticks.h"
#include "modmachine.h"


#define SDCARD_INIT_ARG_ID (0)

#define SDMMC_VOLTAGE_WINDOW_SD            0x80100000U
#define SDMMC_HIGH_CAPACITY                0x40000000U
#define SD_SWITCH_1_8V_CAPACITY            ((uint32_t)0x01000000U)
#define SDMMC_MAX_VOLT_TRIAL               ((uint32_t)0x0000FFFFU)
#define SDMMC_R1_CURRENT_STATE(x) (((x) & 0x00001E00U) >> 9U)

#define BOARD_SDMMC_HOST_DMA_DESCRIPTOR_BUFFER_SIZE (32U)
#define BOARD_SDMMC_DATA_BUFFER_ALIGN_SIZE (32U)
#define FSL_SDMMC_DEFAULT_BLOCK_SIZE (512U)

typedef struct _machine_adc_obj_t {
    mp_obj_base_t base;
    USDHC_Type *sdcard;
    uint32_t rca;
    uint16_t block_len;
    uint32_t block_count;
} mimxrt_sdcard_obj_t;

typedef struct _cid_t {
    uint8_t reserved_0;
    uint16_t mdt : 12;
    uint16_t reserved_1 : 4;
    uint32_t psn;
    uint8_t prv;
    char pnm[6];
    uint16_t oid;
    uint8_t mid;
} __attribute__((packed)) cid_t;

typedef struct _csd_t {
    uint32_t reserved_0;
    uint32_t reserved_1 : 2;
    uint32_t file_format : 2;
    uint32_t temp_write_protect : 1;
    uint32_t perm_write_protecct : 1;
    uint32_t copy : 1;
    uint32_t file_format_grp : 1;
    uint32_t reserved_2 : 5;
    uint32_t write_bl_partial : 1;
    uint32_t write_bl_len : 4;
    uint32_t r2w_factor : 3;
    uint32_t reserved_3 : 2;
    uint32_t wr_grp_enable : 1;
    uint64_t wp_grp_size : 7;
    uint64_t sector_size : 7;
    uint64_t erase_blk_en : 1;
    uint64_t c_size_mult : 3;
    uint64_t vdd_w_curr_max : 3;
    uint64_t vdd_w_curr_min : 3;
    uint64_t vdd_r_curr_max : 3;
    uint64_t vdd_r_curr_min : 3;
    uint64_t c_size : 12;
    uint64_t reserved_4 : 2;
    uint64_t dsr_imp : 1;
    uint64_t read_blk_misalign : 1;
    uint64_t write_blk_misalign : 1;
    uint64_t read_bl_partial : 1;
    uint64_t read_bl_len : 4;
    uint64_t ccc : 12;
    uint32_t tran_speed : 8;
    uint32_t nsac : 8;
    uint32_t taac : 8;
    uint32_t reserved_5 : 6;
    uint32_t csd_structure : 2;
} __attribute__((packed)) csd_t;

typedef enum _sdmmc_r1_current_state
{
    kSDMMC_R1StateIdle        = 0U, /*!< R1: current state: idle */
    kSDMMC_R1StateReady       = 1U, /*!< R1: current state: ready */
    kSDMMC_R1StateIdentify    = 2U, /*!< R1: current state: identification */
    kSDMMC_R1StateStandby     = 3U, /*!< R1: current state: standby */
    kSDMMC_R1StateTransfer    = 4U, /*!< R1: current state: transfer */
    kSDMMC_R1StateSendData    = 5U, /*!< R1: current state: sending data */
    kSDMMC_R1StateReceiveData = 6U, /*!< R1: current state: receiving data */
    kSDMMC_R1StateProgram     = 7U, /*!< R1: current state: programming */
    kSDMMC_R1StateDisconnect  = 8U, /*!< R1: current state: disconnect */
} sdmmc_r1_current_state_t;

enum
{
    SdCmd_GoIdleState        = 0U,
    SdCmd_AllSendCid         = 2U,
    SdCmd_SendRelAddr        = 3U,
    SdCmd_SetDsr             = 4U,
    SdCmd_SelectCard         = 7U,
    SdCmd_SendIfCond         = 8U,
    SdCmd_SendCsd            = 9U,
    SdCmd_SendCid            = 10U,
    SdCmd_StopTransmission   = 12U,
    SdCmd_SendStatus         = 13U,
    SdCmd_GoInactiveState    = 15U,
    SdCmd_SetBlockLength     = 16U,
    SdCmd_ReadSingleBlock    = 17U,
    SdCmd_ReadMultipleBlock  = 18U,
    SdCmd_SetBlockCount      = 23U,
    SdCmd_WriteSingleBlock   = 24U,
    SdCmd_WriteMultipleBlock = 25U,
    SdCmd_ProgramCsd         = 27U,
    SdCmd_SetWriteProtect    = 28U,
    SdCmd_ClearWriteProtect  = 29U,
    SdCmd_SendWriteProtect   = 30U,
    SdCmd_Erase              = 38U,
    SdCmd_LockUnlock         = 42U,
    SdCmd_ApplicationCommand = 55U,
    SdCmd_GeneralCommand     = 56U,
    SdCmd_ReadOcr            = 58U,
    SdAcmd_SendOpCond        = 41U,
};

enum
{
    kSDMMC_R1OutOfRangeFlag                  = 31, /*!< Out of range status bit */
    kSDMMC_R1AddressErrorFlag                = 30, /*!< Address error status bit */
    kSDMMC_R1BlockLengthErrorFlag            = 29, /*!< Block length error status bit */
    kSDMMC_R1EraseSequenceErrorFlag          = 28, /*!< Erase sequence error status bit */
    kSDMMC_R1EraseParameterErrorFlag         = 27, /*!< Erase parameter error status bit */
    kSDMMC_R1WriteProtectViolationFlag       = 26, /*!< Write protection violation status bit */
    kSDMMC_R1CardIsLockedFlag                = 25, /*!< Card locked status bit */
    kSDMMC_R1LockUnlockFailedFlag            = 24, /*!< lock/unlock error status bit */
    kSDMMC_R1CommandCrcErrorFlag             = 23, /*!< CRC error status bit */
    kSDMMC_R1IllegalCommandFlag              = 22, /*!< Illegal command status bit */
    kSDMMC_R1CardEccFailedFlag               = 21, /*!< Card ecc error status bit */
    kSDMMC_R1CardControllerErrorFlag         = 20, /*!< Internal card controller error status bit */
    kSDMMC_R1ErrorFlag                       = 19, /*!< A general or an unknown error status bit */
    kSDMMC_R1CidCsdOverwriteFlag             = 16, /*!< Cid/csd overwrite status bit */
    kSDMMC_R1WriteProtectEraseSkipFlag       = 15, /*!< Write protection erase skip status bit */
    kSDMMC_R1CardEccDisabledFlag             = 14, /*!< Card ecc disabled status bit */
    kSDMMC_R1EraseResetFlag                  = 13, /*!< Erase reset status bit */
    kSDMMC_R1ReadyForDataFlag                = 8,  /*!< Ready for data status bit */
    kSDMMC_R1SwitchErrorFlag                 = 7,  /*!< Switch error status bit */
    kSDMMC_R1ApplicationCommandFlag          = 5,  /*!< Application command enabled status bit */
    kSDMMC_R1AuthenticationSequenceErrorFlag = 3,  /*!< error in the sequence of authentication process */
};

#define SDMMC_MASK(bit) (1U << (bit))

