robert-hh/micropython/ports/mimxrt/machine_sdcard.c
#define SDMMC_R1_ALL_ERROR_FLAG                                                                      \
    (SDMMC_MASK(kSDMMC_R1OutOfRangeFlag) | SDMMC_MASK(kSDMMC_R1AddressErrorFlag) |                   \
    SDMMC_MASK(kSDMMC_R1BlockLengthErrorFlag) | SDMMC_MASK(kSDMMC_R1EraseSequenceErrorFlag) |       \
    SDMMC_MASK(kSDMMC_R1EraseParameterErrorFlag) | SDMMC_MASK(kSDMMC_R1WriteProtectViolationFlag) | \
    SDMMC_MASK(kSDMMC_R1CardIsLockedFlag) | SDMMC_MASK(kSDMMC_R1LockUnlockFailedFlag) |             \
    SDMMC_MASK(kSDMMC_R1CommandCrcErrorFlag) | SDMMC_MASK(kSDMMC_R1IllegalCommandFlag) |            \
    SDMMC_MASK(kSDMMC_R1CardEccFailedFlag) | SDMMC_MASK(kSDMMC_R1CardControllerErrorFlag) |         \
    SDMMC_MASK(kSDMMC_R1ErrorFlag) | SDMMC_MASK(kSDMMC_R1CidCsdOverwriteFlag) |                     \
    SDMMC_MASK(kSDMMC_R1AuthenticationSequenceErrorFlag))


AT_NONCACHEABLE_SECTION_ALIGN(static uint32_t sdcard_read_buffer[FSL_SDMMC_DEFAULT_BLOCK_SIZE / 4U], 4U);
AT_NONCACHEABLE_SECTION_ALIGN(static uint32_t sdcard_write_buffer[FSL_SDMMC_DEFAULT_BLOCK_SIZE / 4U], 4U);
AT_NONCACHEABLE_SECTION_ALIGN(static uint32_t s_sdmmcHostDmaBuffer[BOARD_SDMMC_HOST_DMA_DESCRIPTOR_BUFFER_SIZE], 4U);

#if defined SDMMCHOST_ENABLE_CACHE_LINE_ALIGN_TRANSFER && SDMMCHOST_ENABLE_CACHE_LINE_ALIGN_TRANSFER
/* two cache line length for sdmmc host driver maintain unalign transfer */
SDK_ALIGN(static uint8_t s_sdmmcCacheLineAlignBuffer[BOARD_SDMMC_DATA_BUFFER_ALIGN_SIZE * 2U], BOARD_SDMMC_DATA_BUFFER_ALIGN_SIZE);
#endif

STATIC mimxrt_sdcard_obj_t mimxrt_sdcard_objs[1] = {
    {
        .base.type = &machine_sdcard_type,
        .sdcard = USDHC1,
        .rca = 0x0UL,
        .block_len = FSL_SDMMC_DEFAULT_BLOCK_SIZE,
        .block_count = 0UL,
    }
};

STATIC const mp_arg_t allowed_args[] = {
    [SDCARD_INIT_ARG_ID]     { MP_QSTR_id, MP_ARG_INT, {.u_int = 0} },
};


static void decode_csd(mimxrt_sdcard_obj_t *sdcard, csd_t *csd) {
    sdcard->block_len = (1U << (csd->read_bl_len));
    sdcard->block_count = ((csd->c_size + 1U) << (csd->c_size_mult + 2U));

    if (sdcard->block_len != FSL_SDMMC_DEFAULT_BLOCK_SIZE)
    {
        sdcard->block_count = (sdcard->block_count * sdcard->block_len);
        sdcard->block_len  = FSL_SDMMC_DEFAULT_BLOCK_SIZE;
        sdcard->block_count = (sdcard->block_count / sdcard->block_len);
    }
}

static void sdcard_check_status(status_t status, uint8_t command) {
    if (status != kStatus_Success) {
        mp_printf(&mp_plat_print, "CMD %d failed!", command);
        switch (status)
        {
            case (kStatus_USDHC_BusyTransferring): {
                mp_printf(&mp_plat_print, " - BusyTransferring (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_PrepareAdmaDescriptorFailed): {
                mp_printf(&mp_plat_print, " - PrepareAdmaDescriptorFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_SendCommandFailed): {
                mp_printf(&mp_plat_print, " - SendCommandFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_TransferDataFailed): {
                mp_printf(&mp_plat_print, " - TransferDataFailed (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_DMADataAddrNotAlign): {
                mp_printf(&mp_plat_print, " - DMADataAddrNotAlign (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_ReTuningRequest): {
                mp_printf(&mp_plat_print, " - ReTuningRequest (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_TuningError): {
                mp_printf(&mp_plat_print, " - TuningError (%d)\n", status);
                break;
            }
            case (kStatus_USDHC_NotSupport): {
                mp_printf(&mp_plat_print, " - NotSupport (%d)\n", status);
                break;
            }
            default: {
                mp_printf(&mp_plat_print, " - Unknown\n");
                break;
            }
        }
    }
}

static void sdcard_card_status(uint8_t current_state) {
    switch (current_state)
    {
        case kSDMMC_R1StateIdle: {
            mp_printf(&mp_plat_print, "Card State: StateIdle\n");
            break;
        }
        case kSDMMC_R1StateReady: {
            mp_printf(&mp_plat_print, "Card State: StateReady\n");
            break;
        }
        case kSDMMC_R1StateIdentify: {
            mp_printf(&mp_plat_print, "Card State: StateIdentify\n");
            break;
        }
        case kSDMMC_R1StateStandby: {
            mp_printf(&mp_plat_print, "Card State: StateStandby\n");
            break;
        }
        case kSDMMC_R1StateTransfer: {
            mp_printf(&mp_plat_print, "Card State: StateTransfer\n");
            break;
        }
        case kSDMMC_R1StateSendData: {
            mp_printf(&mp_plat_print, "Card State: StateSendData\n");
            break;
        }
        case kSDMMC_R1StateReceiveData: {
            mp_printf(&mp_plat_print, "Card State: StateReceiveData\n");
            break;
        }
        case kSDMMC_R1StateProgram: {
            mp_printf(&mp_plat_print, "Card State: StateProgram\n");
            break;
        }
        case kSDMMC_R1StateDisconnect: {
            mp_printf(&mp_plat_print, "Card State: StateDisconnect\n");
            break;
        }
        default: {
            mp_printf(&mp_plat_print, "Card State: INVALID!!!\n");
        }
    }
}

static void sdcard_cmd_go_idle_state(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SdCmd_GoIdleState,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeNone,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_GoIdleState);
}

static uint32_t sdcard_cmd_oper_cond(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SdCmd_SendIfCond,
        .argument = 0x000001AAU,       // 2.7-3.3V range and 0xAA check pattern
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR7,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_SendIfCond);
    return command.response[0];
}

static uint32_t sdcard_cmd_app_cmd(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SdCmd_ApplicationCommand,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdCmd_ApplicationCommand);
    sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));
    return command.response[0];
}

static uint32_t sdcard_cmd_sd_app_op_cond(USDHC_Type *base, uint32_t argument) {
    status_t status;
    usdhc_command_t command = {
        .index = SdAcmd_SendOpCond,
        .argument = argument,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR3,
    };

    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = USDHC_TransferBlocking(base, NULL, &transfer);
    sdcard_check_status(status, SdAcmd_SendOpCond);
    return command.response[0];
}

