robert-hh/micropython/ports/mimxrt/machine_sdcard.c
// ioctl(op, arg)
STATIC mp_obj_t machine_sdcard_ioctl(mp_obj_t self_in, mp_obj_t cmd_in, mp_obj_t arg_in) {
    mimxrt_sdcard_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_int_t cmd = mp_obj_get_int(cmd_in);
    // ---
    bool valid_voltage = false;
    uint32_t count = 0UL;
    uint32_t response;
    // ---
    switch (cmd) {
        case MP_BLOCKDEV_IOCTL_INIT: {
            // Reset Card
            if (USDHC_Reset(self->sdcard, (USDHC_SYS_CTRL_RSTA_MASK | USDHC_SYS_CTRL_RSTC_MASK | USDHC_SYS_CTRL_RSTD_MASK), 2048) == false) {
                mp_printf(&mp_plat_print, "USDHC_Reset timed out!\n");
                return MP_OBJ_NEW_SMALL_INT(-1); // error
            } else {
                mp_printf(&mp_plat_print, "USDHC_Reset performed\n");
            }

            if (USDHC_SetCardActive(self->sdcard, 8192) == false) { // TODO: remove timeout check or change to calculated value based on CLK frequency
                mp_printf(&mp_plat_print, "USDHC_SetCardActive timed out!\n");
                return MP_OBJ_NEW_SMALL_INT(-1); // error
            } else {
                mp_printf(&mp_plat_print, "USDHC_SetCardActive performed\n");
            }


            sdcard_cmd_go_idle_state(self->sdcard);
            sdcard_cmd_oper_cond(self->sdcard);

            // Perform voltage validation
            while ((count < SDMMC_MAX_VOLT_TRIAL) && (valid_voltage == 0U)) {
                sdcard_cmd_app_cmd(self->sdcard);
                response = sdcard_cmd_sd_app_op_cond(self->sdcard, (uint32_t)(SDMMC_VOLTAGE_WINDOW_SD | SDMMC_HIGH_CAPACITY | SD_SWITCH_1_8V_CAPACITY));

                /* Get operating voltage*/
                valid_voltage = (((response >> 31U) == 1U) ? true : false);
                count++;

                if (!(count % 10000)) {
                    mp_printf(&mp_plat_print, "\t%d Voltage validation cycles executed\n", count);
                }
            }

            if (count >= SDMMC_MAX_VOLT_TRIAL) {
                mp_printf(&mp_plat_print, "Invalid voltage range!\n");
                return MP_OBJ_NEW_SMALL_INT(-1); // error
            } else {
                mp_printf(&mp_plat_print, "Voltage validation performed (%d cycles)\n", count);
            }

            cid_t cid_all = sdcard_cmd_all_send_cid(self->sdcard);
            sdcard_print_cid(cid_all);

            self->rca = sdcard_cmd_set_rel_add(self->sdcard);
            mp_printf(&mp_plat_print, "RCA received - 0x%04X\n", self->rca);

            // Stand-by State (stby) reached
            uint32_t usdhc_clk = USDHC_SetSdClock(self->sdcard, CLOCK_GetSysPfdFreq(kCLOCK_Pfd2) / 3, 20000000UL);
            mp_printf(&mp_plat_print, "Actual USDHC clock: %dHz (%dHz)\n", usdhc_clk, 20000000UL);

            cid_t cid = sdcard_cmd_send_cid(self->sdcard, self->rca);
            sdcard_print_cid(cid);

            csd_t csd = sdcard_cmd_send_csd(self->sdcard, self->rca);
            decode_csd(self, &csd);

            sdcard_cmd_select_card(self->sdcard, self->rca);
            return MP_OBJ_NEW_SMALL_INT(0);
        }
        case MP_BLOCKDEV_IOCTL_DEINIT:
        case MP_BLOCKDEV_IOCTL_SYNC: {
            return MP_OBJ_NEW_SMALL_INT(0);
        }
        case MP_BLOCKDEV_IOCTL_BLOCK_COUNT: {
            return MP_OBJ_NEW_SMALL_INT(self->block_count);
        }
        case MP_BLOCKDEV_IOCTL_BLOCK_SIZE: {
            return MP_OBJ_NEW_SMALL_INT(self->block_len);
        }
        default: // unknown command
        {
            return MP_OBJ_NEW_SMALL_INT(-1); // error
        }
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(machine_sdcard_ioctl_obj, machine_sdcard_ioctl);

STATIC const mp_rom_map_elem_t sdcard_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_init),        MP_ROM_PTR(&machine_sdcard_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit),      MP_ROM_PTR(&machine_sdcard_deinit_obj) },
    // block device protocol
    { MP_ROM_QSTR(MP_QSTR_readblocks),  MP_ROM_PTR(&machine_sdcard_readblocks_obj) },
    { MP_ROM_QSTR(MP_QSTR_writeblocks), MP_ROM_PTR(&machine_sdcard_writeblocks_obj) },
    { MP_ROM_QSTR(MP_QSTR_ioctl),       MP_ROM_PTR(&machine_sdcard_ioctl_obj) },
};
STATIC MP_DEFINE_CONST_DICT(sdcard_locals_dict, sdcard_locals_dict_table);

const mp_obj_type_t machine_sdcard_type = {
    { &mp_type_type },
    .name = MP_QSTR_SDCard,
    .make_new = sdcard_obj_make_new,
    .locals_dict = (mp_obj_dict_t *)&sdcard_locals_dict,
};

void machine_sdcard_init0(void) {
    return;
}